args_for_gen = {
    "lc": ["421", "17117","81000", "1"],
    "add": [1024, 24, 55, 23, 517, 897, 480, 376, 94, 23, 517, 897, 480, 376, 94, 23, 517, 897, 480, 376, 94, 23, 517, 897,
     480, 376, 94, 23, 517, 897, 480, 376, 94, 23, 517, 897, 480, 376, 94, 23, 517, 897, 480, 376, 94, 23, 517, 897,
     480, 376, 94, 23, 517, 897, 480, 376, 94, 23],
    "lfsr":["100000001001001", "0011000000"],
    "fp": [87, 20, 40, 69, 9, 7716351738766551435189019318376542618311247],
    "nfsr": ["100000001001001", "0011000000", "101011001001001", "11010011000000", "101100010001001", "10110000111"],
    "rc4": [213,968,838,64,355,214,212,36,695,139,897,518,656,956,810,510,985,105,670,8,907,951,685,989,222,931,169,286,
            289,556,731,902,688,701,771,533,990,630,708,884,255,683,25,214,792,348,34,758,9,781,946,580,615,955,585,5,
            886,563,81,38,809,444,619,222,544,53,635,621,630,251,497,257,2,467,897,790,728,676,722,838,465,781,10,828,
            903,235,857,841,146,719,681,678,961,652,491,38,256,909,251,21,110,811,273,25,642,286,489,478,184,812,770,
            846,241,141,266,500,375,827,633,761,154,663,461,206,529,212,667,342,360,165,523,749,582,803,553,345,
            786,990,361,702,256,380,234,238,73,965,266,300,847,755,969,681,146,843,125,306,845,752,879,458,788,833,
            727,817,122,239,765,877,827,327,733,658,644,880,150,474,493,689,670,368,611,263,113,417,834,103,725,754,117,
            824,623,338,540,337,879,521,183,370,808,120,571,871,301,210,796,744,398,106,845,745,842,876,399,27,105,601,802,
            831,53,266,157,352,175,303,505,484,994,425,292,729,654,584,860,420,412,49,281,417,703,400,48,404,772,389,733,152,
            271,585,404,333,381,696,928,609,659,180,9],
    "rsa": ["12709189", "53", "245", "10"], 
    "bbs": ["15621", "10"],
    "mt" : ["1024","17461461673"],
}

met = "\n1. Выберите метод:\n\tlc-линейный конгруэнтный;\n\tadd-адитивный;\n\t5p-пятипараметрический;\n\tlfsr-регистр сдвига с обратной связью(РСЛОС);\n\tnfsr-нелинейная комбинация РСЛОС;\n\tmt-Вихрь Мерсена;\n\trc4-RC4;\n\trsa-ГПСЧ на основе RSA;\n\tbbs-алгоритм Блюма-Блюма-Шуба;"
por = "\n2. Задайте порядок:\n\tlc-модуль, множитель, приращение, начальное значение\n\tadd-модуль, младший индекс, старший индекс, последовательность начальных значений\n\t5p-p,q1,q2,q3,w, начальное значение;\n\tlfsr-двоичное представление вектора коэффициентов, начальное значение регистра;\n\tnfsr-параметры для R1,R2,R3,длина слова;\n\tmt-модуль, начальное значение x;\n\trc4-256 начальных значений, количество генерируемых бит;\n\trc4-модуль, число e, w, начальное значение;\n\tbbs-начальное значение, длина слова;\n"
dist = "\n1. Выберите распределение:\n\tst – стандартное равномерное с заданным интервалом;\n\ttr – треугольное распределение;\n\tex – общее экспоненциальное распределение;\n\tnr – нормальное распределение;\n\tgm – гамма распределение;\n\tln – логнормальное распределение;\n\tls – логистическое распределение;\n\tbi – биномиальное распределение."

